bright-pan/smartlock2/bsp/stm32f10x/drivers/fprint.c
error_process:
	return error;
}
// struct member offset
#define offsetof(TYPE, MEMBER) ((size_t) &((TYPE *)0)->MEMBER)
/*
    receive frame data.
    uint8_t *buf: receive frame data.
    uint16_t size: receive frame length
*/
__STATIC_INLINE uint16_t
fprint_frame_recv_data(uint8_t *buf, uint16_t size)
{
	uint16_t cs;
	rt_device_t fprint_device;
	uint16_t data_length, data_offset;
    uint16_t check = 0;
	rt_size_t recv_cnts;
	FPRINT_ERROR_TYPEDEF error;
	uint8_t cnts;
    FPRINT_FRAME_HEAD_TYPEDEF head;

    data_length = 0;
    data_offset = 0;

	error = FPRINT_EERROR;


	fprint_device = device_enable(DEVICE_NAME_FPRINT);
	if (fprint_device == RT_NULL)
		goto error_process;
    
    // frame head process
    while (size > 0)
    {
        for (cnts = 0; cnts < 20; cnts++) {
            rt_thread_delay(20);
            recv_cnts = rt_device_read(fprint_device, 0, &head, sizeof(head));
            if (recv_cnts != sizeof(head)) {
                if (recv_cnts == 0) {
                    error = FPRINT_ERESPONSE;
                    continue;
                } else {
                    error = FPRINT_EERROR;
                    goto error_process;
                }
            } else {
                error = FPRINT_EERROR;
                break;
            }
        }

        if (error == FPRINT_ERESPONSE)
            goto error_process;

        reverse((uint8_t *)&data_length, head.len, sizeof(data_length));
/*

        if (data_length > size)
            goto error_process;
*/
        // frame data length process
        data_length -= 2;

        if (data_length > size)
            goto error_process;

        switch (head.pid)
        {
            case FPRINT_FRAME_PID_DATA:
                {
                    size -= data_length;
                    break;
                }
            case FPRINT_FRAME_PID_END:
                {
                    size = 0;
                    break;
                }

            default :
                {
                    size = 0;
                    break;
                }
        }
        // read data from device
        recv_cnts = rt_device_read(fprint_device, 0, (uint8_t *)buf + data_offset, data_length);
        if (recv_cnts < data_length)
            goto error_process;
        // verify checksum
        cs = 0;
        cs = check_sum((uint8_t *)&head + 6, sizeof(head) - 6);
        cs +=  check_sum((uint8_t *)buf + data_offset, data_length);
        check = 0;
        recv_cnts = rt_device_read(fprint_device, 0, (uint8_t *)&check, 2);
        if (recv_cnts < 2)
            goto error_process;
#if (defined RT_USING_FINSH) && (FPRINT_DEBUG == 1)
        rt_kprintf("\nfprint recv :---------------------\n");
        print_hex((uint8_t *)&head, sizeof(head));
        print_hex((uint8_t *)buf+data_offset, data_length);
        print_hex((uint8_t *)&check, sizeof(check));
        rt_kprintf("------------------------------------\n");
#endif // RT_USING_FINSH
        //reverse((uint8_t *)&check, (uint8_t *)&check, sizeof(check));
        __REV16(check);
        if (cs==check)
        {
            error = FPRINT_EOK;
        }

        data_offset += data_length;
    }
error_process:

	return data_offset;

}

/*
    send frame extra data.
    void *buffer: data adress.
    uint16_t size: data length.
*/
__STATIC_INLINE uint16_t
fprint_frame_send_data(void *buffer, uint16_t size)
{
	uint16_t cs;
    u8 *buf;
	rt_device_t fprint_device;
	uint16_t data_length, data_offset, frame_data_size;
    FPRINT_FRAME_HEAD_TYPEDEF head;
    uint16_t start = FPRINT_FRAME_START;
    uint32_t addr = FPRINT_FRAME_ADDR;
    data_length = 0;
    data_offset = 0;
    frame_data_size = fprint_param_data_size_map[FPRINT_PARAM_DATA_SIZE];
    buf = buffer;
	fprint_device = device_enable(DEVICE_NAME_FPRINT);
	if (fprint_device == RT_NULL)
		goto error_process;
    while (size > 0)
    {
        rt_memset(&head, 0, sizeof(head));

        reverse(head.start, (uint8_t *)&start, sizeof(start));
        reverse(head.addr, (uint8_t *)&addr, sizeof(addr));

        if (size > frame_data_size) {
            data_length = frame_data_size;
            head.pid = FPRINT_FRAME_PID_DATA;
        } else {
            data_length = size;
            head.pid = FPRINT_FRAME_PID_END;
        }
        size -= data_length;

        //reverse((uint8_t *)&data_length, head.len, sizeof(data_length));


        data_length += 2;
        reverse(head.len, (uint8_t *)&data_length, sizeof(data_length));
        data_length -= 2;
        cs = check_sum((uint8_t *)&head+6, sizeof(head)-6) + check_sum(buf + data_offset, data_length);
        rt_device_write(fprint_device, 0, &head, sizeof(head));
        rt_device_write(fprint_device, 0, buf + data_offset, data_length);
        cs = __REV16(cs);
        rt_device_write(fprint_device, 0, &cs, 2);

#if (defined RT_USING_FINSH) && (FPRINT_DEBUG == 1)
        rt_kprintf("\nfprint send :---------------------\n");
        print_hex((uint8_t *)&head, sizeof(head));
        print_hex((uint8_t *)buf + data_offset, data_length);
        print_hex((uint8_t *)&cs, sizeof(cs));
        rt_kprintf("------------------------------------\n");
#endif
        data_offset += data_length;
    }
error_process:

	return data_offset;

}

/*
    receive frame
    uint8_t cmd: frame command
    FPRINT_FRAME_HEAD_TYPEDEF *frame_head: frame head
    FPRINT_FRAME_REP_DATA_TYPEDEF *rep_data: frame response data
*/
__STATIC_INLINE FPRINT_ERROR_TYPEDEF
fprint_frame_recv(uint8_t cmd, FPRINT_FRAME_HEAD_TYPEDEF *frame_head,
				  FPRINT_FRAME_REP_DATA_TYPEDEF *rep_data)
{
	uint16_t cs;
	rt_device_t fprint_device;
	uint16_t data_length;
	rt_size_t recv_cnts;
	FPRINT_ERROR_TYPEDEF error;
	uint8_t cnts;

    data_length = 0;

	error = FPRINT_EERROR;

	fprint_device = device_enable(DEVICE_NAME_FPRINT);
	if (fprint_device == RT_NULL)
		goto error_process;
    // receive frame head
	for (cnts = 0; cnts < 20; cnts++) {
		rt_thread_delay(20);
		recv_cnts = rt_device_read(fprint_device, 0, frame_head, sizeof(*frame_head));
		if (recv_cnts != sizeof(*frame_head)) {
			if (recv_cnts == 0) {
				error = FPRINT_ERESPONSE;
				continue;
			} else {
				error = FPRINT_EERROR;
				goto error_process;
			}
		} else {
			error = FPRINT_EERROR;
			break;
		}
	}

