bright-pan/smartlock2/bsp/stm32f10x/drivers/fprint.c
	if (error == FPRINT_ERESPONSE)
		goto error_process;

    reverse((uint8_t *)&data_length, frame_head->len, sizeof(data_length));
    // receice from device
	recv_cnts = rt_device_read(fprint_device, 0, (uint8_t *)rep_data, data_length);
	if (recv_cnts < data_length)
		goto error_process;
    // verify check sum
    cs = check_sum((uint8_t *)frame_head + 6, sizeof(*frame_head) - 6);
    cs +=  check_sum((uint8_t *)rep_data, data_length-2);
	if (*((uint8_t *)rep_data + data_length -2) == ((uint8_t *)&cs)[1] && *((uint8_t *)rep_data + data_length -1) == ((uint8_t *)&cs)[0])
	{
		error = FPRINT_EOK;
	}
#if (defined RT_USING_FINSH) && (FPRINT_DEBUG == 1)
	rt_kprintf("\nfprint recv :---------------------\n");
	print_hex((uint8_t *)frame_head, sizeof(*frame_head));
	print_hex((uint8_t *)rep_data, data_length);
	rt_kprintf("------------------------------------\n");
#endif // RT_USING_FINSH

error_process:

	return error;
}

/*
    frame process for send request frame and receive response frame.
    uint8_t cmd: frame cmd 
    FPRINT_FRAME_REQ_DATA_TYPEDEF *req_data: frame request data 
    FPRINT_FRAME_REP_DATA_TYPEDEF *rep_data: frame response data
*/
__STATIC_INLINE FPRINT_ERROR_TYPEDEF
fprint_frame_process(uint8_t cmd, FPRINT_FRAME_REQ_DATA_TYPEDEF *req_data, FPRINT_FRAME_REP_DATA_TYPEDEF *rep_data)
{
	FPRINT_ERROR_TYPEDEF error;
	FPRINT_FRAME_HEAD_TYPEDEF head;

    uint16_t start = FPRINT_FRAME_START;
    uint32_t addr = FPRINT_FRAME_ADDR;
    error = FPRINT_EERROR;
    switch (cmd)
    {
        case FPRINT_FRAME_CMD_VERIFY:
        case FPRINT_FRAME_CMD_EMPTY:
        case FPRINT_FRAME_CMD_SET_PARAM:
        case FPRINT_FRAME_CMD_SET_ADDR:
        case FPRINT_FRAME_CMD_GET_IMAGE:
        case FPRINT_FRAME_CMD_GENERATE:
        case FPRINT_FRAME_CMD_MERGE:
        case FPRINT_FRAME_CMD_UP_CHAR:
        case FPRINT_FRAME_CMD_DOWN_CHAR:
        case FPRINT_FRAME_CMD_LOAD_CHAR:
        case FPRINT_FRAME_CMD_STORE_CHAR:
        case FPRINT_FRAME_CMD_DEL_CHAR:
        case FPRINT_FRAME_CMD_SEARCH:
            {
                break;
            }
        default :
            {
                RT_DEBUG_LOG(FPRINT_DEBUG, ("the finger print frame request cmd 0x%02X is invalid!\n", cmd));
                goto process_error;
            }
    }

	error = FPRINT_EERROR;


	rt_memset(&head, 0, sizeof(head));

	reverse(head.start, (uint8_t *)&start, sizeof(start));
    reverse(head.addr, (uint8_t *)&addr, sizeof(addr));

    head.pid = FPRINT_FRAME_PID_CMD;
    // send frame data
	error = fprint_frame_send(cmd, &head, req_data);
	if (error != FPRINT_EOK)
		goto process_error;
    //rt_thread_delay(50);
    // receive frame data
	error = fprint_frame_recv(cmd, &head, rep_data);
	if (error != FPRINT_EOK)
		goto process_error;
    // process result
    error = FPRINT_EERROR;
    switch (cmd)
    {
        case FPRINT_FRAME_CMD_VERIFY:
            {
                if (rep_data->rep_verify.result == FPRINT_FRAME_ERR_SUCCESS)
                    error  = FPRINT_EOK;
                break;
            }
        case FPRINT_FRAME_CMD_EMPTY:
            {
                if (rep_data->rep_empty.result == FPRINT_FRAME_ERR_SUCCESS)
                    error  = FPRINT_EOK;
                break;
            }
        case FPRINT_FRAME_CMD_SET_PARAM:
            {
                if (rep_data->rep_set_param.result == FPRINT_FRAME_ERR_SUCCESS)
                    error  = FPRINT_EOK;
                break;
            }
        case FPRINT_FRAME_CMD_SET_ADDR:
            {
                if (rep_data->rep_set_addr.result == FPRINT_FRAME_ERR_SUCCESS)
                    error  = FPRINT_EOK;
                break;
            }
        case FPRINT_FRAME_CMD_GET_IMAGE:
            {
                if (rep_data->rep_get_image.result == FPRINT_FRAME_ERR_SUCCESS)
                    error  = FPRINT_EOK;
                else if (rep_data->rep_get_image.result == FPRINT_FRAME_ERR_FP_NOT_DETECTED)
                    error = FPRINT_ENO_DETECTED;
                break;
            }
        case FPRINT_FRAME_CMD_GENERATE:
            {
                if (rep_data->rep_generate.result == FPRINT_FRAME_ERR_SUCCESS)
                    error  = FPRINT_EOK;
                break;
            }
        case FPRINT_FRAME_CMD_MERGE:
            {
                if (rep_data->rep_merge.result == FPRINT_FRAME_ERR_SUCCESS)
                    error  = FPRINT_EOK;
                break;
            }
        case FPRINT_FRAME_CMD_UP_CHAR:
            {
                if (rep_data->rep_up_char.result == FPRINT_FRAME_ERR_SUCCESS) {
                    error  = FPRINT_EOK;

                }
                break;
            }
        case FPRINT_FRAME_CMD_DOWN_CHAR:
            {
                if (rep_data->rep_down_char.result == FPRINT_FRAME_ERR_SUCCESS) {
                    error  = FPRINT_EOK;

                }
                break;
            }
        case FPRINT_FRAME_CMD_LOAD_CHAR:
            {
                if (rep_data->rep_load_char.result == FPRINT_FRAME_ERR_SUCCESS) {
                    error  = FPRINT_EOK;

                }
                break;
            }
        case FPRINT_FRAME_CMD_STORE_CHAR:
            {
                if (rep_data->rep_store_char.result == FPRINT_FRAME_ERR_SUCCESS) {
                    error  = FPRINT_EOK;

                }
                break;
            }
        case FPRINT_FRAME_CMD_DEL_CHAR:
            {
                if (rep_data->rep_del_char.result == FPRINT_FRAME_ERR_SUCCESS) {
                    error  = FPRINT_EOK;

                }
                break;
            }
        case FPRINT_FRAME_CMD_SEARCH:
            {
                if (rep_data->rep_search.result == FPRINT_FRAME_ERR_SUCCESS || rep_data->rep_search.result == FPRINT_FRAME_ERR_NO_SEARCH) {
                    error  = FPRINT_EOK;

                }
                break;
            }
        default :
            {
                goto process_error;
            }
    }

process_error:

	return error;
}
/*
    key sync for fprint.
    struct key *k, key data
    int key_id, key id
    void *arg1, request data
    void *arg2£¬ response data
*/
int fprint_key_init_callback(struct key *k, int key_id, void *arg1, void *arg2)
{
    FPRINT_ERROR_TYPEDEF error = FPRINT_EERROR;
    FPRINT_FRAME_REQ_DATA_TYPEDEF *req_data = arg1;
    FPRINT_FRAME_REP_DATA_TYPEDEF *rep_data = arg2;
    key_id += FPRINT_TEMPLATE_OFFSET;
    if (k->head.key_type == KEY_TYPE_FPRINT) {
        rt_memset(req_data, 0, sizeof(*req_data));
        rt_memset(rep_data, 0, sizeof(*rep_data));
        req_data->req_down_char.buf_id = 1;
        // down char to rambuf1
        error = fprint_frame_process(FPRINT_FRAME_CMD_DOWN_CHAR, req_data, rep_data);
        if (error != FPRINT_EOK)
            return error;
		fprint_frame_send_data(&k->data,512);
        /*
        // get fprint template from rambuf0
        rt_memset(req_data, 0, sizeof(*req_data));
        rt_memset(rep_data, 0, sizeof(*rep_data));
        req_data->req_up_char.buf_id = 1;
        error = fprint_frame_process(FPRINT_FRAME_CMD_UP_CHAR,
                                        req_data, rep_data);
        if (error == FPRINT_EOK) {
            u8 buf[512];
            fprint_frame_recv_data(buf, 512);
            print_hex(buf, 512);
        }
        */
		// store fprint template to template_id
		rt_memset(req_data, 0, sizeof(*req_data));
		rt_memset(rep_data, 0, sizeof(*rep_data));
        req_data->req_store_char.buf_id = 1;
		reverse(req_data->req_store_char.template_id, (uint8_t *)&key_id, 2);
		error = fprint_frame_process(FPRINT_FRAME_CMD_STORE_CHAR, req_data, rep_data);

