bright-pan/smartlock2/bsp/stm32f10x/drivers/fprint.c
/*
    fprint delete
    const uint16_t key_id, delete key id
    const uint16_t size, delete size
*/
int
fp_delete(const uint16_t key_id, const uint16_t size)
{
    int result = -1;

    if (send_fp_mail(FPRINT_CMD_DELETE, (uint16_t *)&key_id, RT_NULL, size, 1) == FPRINT_EOK)
        result = key_id;
    return result;
}

/*
    fprint verify
*/
int
fp_verify(void)
{
    int result = -1;
    int i;
    
    for (i = 0; i < 100; ++i) {
        if (gpio_pin_input(DEVICE_NAME_FP_TOUCH, 0) == FP_TOUCH_STATUS) {
            result = send_fp_mail(FPRINT_CMD_VERIFY, RT_NULL, RT_NULL, 0, 1);
            if (result == FPRINT_EOK)
                break;
        } else {
            rt_thread_delay(10);
        }
    }
    
    return result;
}

/*
    fprint work inform 
*/
void
fp_inform(void)
{
    if (enroll_flag)
        rt_sem_release(s_fprint);
    else
        fp_verify();
}
/*
    fprint up char template
*/
int
fp_up_char(uint16_t key_id)
{

    int result = -1;
    if (send_fp_mail(FPRINT_CMD_UP_CHAR, (uint16_t *)&key_id, RT_NULL, 0, 1) == FPRINT_EOK)
        result = 0;
    return result;
}
#ifdef RT_USING_FINSH
#include <finsh.h>

void fp_enroll_test(u16 timeout)
{
    uint16_t key_id;
    uint8_t buf[512];
    if (fp_enroll(&key_id, buf, timeout) >= 0) {
        rt_kprintf("key_id = %d\n--------------------\n", key_id);
        print_hex(buf, 512);
    } else {
        rt_kprintf("fprint enroll timeout\n");
    }
}

FINSH_FUNCTION_EXPORT(fp_init, fp_init[void]);
FINSH_FUNCTION_EXPORT(fp_enroll_test, fp_enroll_test[timeout]);
FINSH_FUNCTION_EXPORT(fp_delete, fp_delete[uint16]);
FINSH_FUNCTION_EXPORT(fp_verify, fp_verify[void]);
FINSH_FUNCTION_EXPORT(fp_inform, fp_inform[void]);
FINSH_FUNCTION_EXPORT_ALIAS(fp_up_char, fp_uchar, fp_up_char[key_id]);
#endif // RT_USING_FINSH
